{
    "pageTitle": "Steven Hall's Resume",
    "firstName": "Steven",
    "lastName": "Hall",
    "position": "Software Engineer",
    "contactInfo": [
        {
            "href": "mailto:steven@stmhall.ca",
            "imgSrc": "imgs/email.png",
            "text": "steven@stmhall.ca"
        },
        {
            "href": "https://github.com/hallzy",
            "imgSrc": "imgs/github.png",
            "text": "hallzy"
        },
        {
            "href": "https://www.linkedin.com/in/steventmhall",
            "imgSrc": "imgs/linkedin.ico",
            "text": "steventmhall"
        }
    ],
    "languages": [
        "JavaScript / jQuery",
        "CSS / SASS / Bootstrap",
        "MobX",
        "MySQL/ PostgreSQL",
        "PHP / Laravel",
        "HTML",
        "Golang",
        "C/ C++",
        "Haskell",
        "Python / Selenium",
        "TypeScript",
        "VimScript",
        "Bash Script",
        "Java"
    ],
    "tools": [
        "Jira",
        "Git/ SVN",
        "Github / Bitbucket",
        "Google Ad Manager",
        "API",
        "JSON",
        "XML",
        "Linux (CLI proficient)",
        "Vim"
    ],
    "skills": [
        "Scrum / Agile",
        "Project Leadership",
        "Communication",
        "Problem Solving",
        "Mentoring"
    ],
    "sections": {
        "summary": {
            "title": "Summary",
            "entries": [
                {
                    "imgSrc": "",
                    "boldTitle": "",
                    "normalTitle": "",
                    "timePeriod": "",
                    "description": [
                        "Full-stack software engineer with over 6 years of experience designing and developing scalable, user-friendly web applications.",
                        "Proven track record in leading major frontend and backend projects, including the complete rewrite of an award-winning video player, resulting in a 4x reduction in code size and enhanced performance that saved the company from months of lost revenue.",
                        "Skilled in JavaScript, PHP, relational databases, and modern frameworks like MobX.",
                        "Adept at mentoring junior developers, optimizing code efficiency, and driving innovation in both corporate and open-source environments.",
                        "Seeking to apply my technical expertise and leadership skills in a dynamic, growth-focused team to build cutting-edge software solutions."
                    ],
                    "skills": [
                    ]
                }
            ]
        },
        "work": {
            "title": "Work Experience",
            "entries": [
                {
                    "imgSrc": "imgs/stnvideo.png",
                    "boldTitle": "STN Video",
                    "normalTitle": "Full Stack Web Developer",
                    "timePeriod": "Oct 2020 - May 2024",
                    "description": [
                        "Completely rewrote our award-winning Smart Match video player frontend from the ground up using the MobX reactivity framework.",
                        "The code became easier to maintain and the file was 4x smaller while improving speed and revenue.",
                        "The rewrite saved us from losing months of revenue because of a change that was made to Google Chrome's Heavy Ad Intervention.",
                        "Writing and maintaining Player tests, improving the reliability of our code by catching bugs before a release.",
                        "Created a new Admin tool on our Dashboard to expose how the player's AI ranks video matches for a publisher's article, improving the company's ability to understand why our AI chooses certain videos over others."
                    ],
                    "skills": [
                        "Remote Work",
                        "JavaScript",
                        "jQuery",
                        "MobX",
                        "Agile",
                        "Scrum",
                        "MySQL",
                        "Git",
                        "Python",
                        "Selenium",
                        "Jira",
                        "PHP",
                        "Laravel",
                        "CSS",
                        "SASS",
                        "Bootstrap",
                        "Eloquent",
                        "Google Ad Manager",
                        "JSON",
                        "XML",
                        "Bash",
                        "Vim"
                    ]
                },
                {
                    "imgSrc": "imgs/linuxmagic.png",
                    "boldTitle": "LinuxMagic",
                    "normalTitle": "Full Stack Web Developer",
                    "timePeriod": "April 2018 - May 2020",
                    "description": [
                        "Worked on feature enhancements, customer requests, and bug fixes for our carrier grade email platform (MagicMail), CRM, sales system, and product websites (MagicSpam, SpamRATS)",
                        "Migrated the sales system from an Oracle database to PostgreSQL.",
                        "Led a project to redesign and rewrite the SpamRATS product website from the ground up.",
                        "Completed work orders for customers by communicating directly with the customer and performing their development work in a timely and professional manner.",
                        "Mentored new Web Developer hires."
                    ],
                    "skills": [
                        "JavaScript",
                        "jQuery",
                        "CSS",
                        "Bootstrap",
                        "Proprietary PHP MVC Framework",
                        "CakePHP",
                        "MySQL",
                        "PostgreSQL",
                        "SVN",
                        "Agile",
                        "Scrum",
                        "Bash",
                        "Vim"
                    ]
                },
                {
                    "imgSrc": "imgs/ubc.ico",
                    "boldTitle": "UBC",
                    "normalTitle": "Big Data Research Assistant",
                    "timePeriod": "May 2016 - Aug 2016",
                    "description": [
                        "Goal: To share memory (RDDs) across Apache Spark instances through a unified memory manager."
                    ],
                    "skills": [
                        "Scala",
                        "Python",
                        "Hadoop",
                        "Apache Spark",
                        "Git",
                        "Bash"
                    ]
                },
                {
                    "imgSrc": "imgs/ericsson.ico",
                    "boldTitle": "Ericsson",
                    "normalTitle": "Software Developer Intern",
                    "timePeriod": "Jan 2015 - Aug 2015",
                    "description": [
                        "Tested and developed QoS and PBR software solutions on a variety of Ericsson's enterprise scale routing platforms using manual router configurations and Perl scripts for testing.",
                        "Presented demos showing the functionality and progress of policy-based routing during the testing and development phases."
                    ],
                    "skills": [
                        "C",
                        "Perl",
                        "Git",
                        "CVS",
                        "Bash"
                    ]
                }
            ]
        },
        "projects": {
            "title": "Open Source Contributions",
            "entries": [
                {
                    "imgSrc": "",
                    "link": "https://github.com/mdn/content/issues/21002",
                    "boldTitle": "Reporting Documentation Error to MDN Web Docs",
                    "normalTitle": "",
                    "timePeriod": "Sept 2022 - Aug 2024",
                    "description": [
                        "I discovered an undocumented stacking context trigger in the MDN Web Docs, which is a unified repository for documentation on web standards.",
                        "At the time, it was not clear if it was a browser bug, or incomplete documentation. It turned out to be part of the feature specification so the documentation was just missing a reference to it.",
                        "The MDN Web Docs has now been updated to reflect this feature that I found."
                    ],
                    "skills": [
                        "CSS"
                    ]
                },
                {
                    "imgSrc": "",
                    "link": "https://github.com/microsoft/playwright/issues/9268",
                    "boldTitle": "Found a Browser Crash Bug In Microsoft Playwright",
                    "normalTitle": "",
                    "timePeriod": "Oct 2021",
                    "description": [
                        "My Firefox browser would crash when running a particular test that used the apstag.js script from Amazon.",
                        "I found that it appeared to be related to Firefox shimming that script internally which interfered with how Playwright worked.",
                        "Microsoft fixed this bug a few weeks later."
                    ],
                    "skills": [
                        "Playwright"
                    ]
                },
                {
                    "imgSrc": "",
                    "link": "https://github.com/hallzy/youtube-playlist-search",
                    "boldTitle": "Youtube Playlist Search Chrome Extension",
                    "normalTitle": "",
                    "timePeriod": "April 2021",
                    "description": [
                        "This is a project that I started which has 72 Stars on GitHub (as of September 17th 2024).",
                        "Goal: Create a chrome extension that is able to search for videos in large playlists by filtering channel names and video titles.",
                        "Includes a custom built searchable dropdown list of channel names you can filter by.",
                        "The search filters are persistent per playlist across your devices.",
                        "Custom built lazy loading that loads 25 or so videos at a time in the view, while being able to search the whole playlist.",
                        "Very large playlists have their video metadata saved for faster retrieval the next time the extension is opened."
                    ],
                    "skills": [
                        "JavaScript",
                        "Youtube API",
                        "CSS",
                        "HTML"
                    ]
                },
                {
                    "imgSrc": "",
                    "entryClasses": "",
                    "link": "https://github.com/hallzy/go-git-radar",
                    "boldTitle": "Go Git Radar",
                    "normalTitle": "",
                    "timePeriod": "Nov 2020",
                    "description": [
                        "My Golang clone of \"Git Radar\" that is 5x faster for large repositories with additional features for enhanced usability.",
                        "The original \"Git Radar\" was written in Bash which was inherently slow with large git repositories.",
                        "This project gives you a \"heads up display\" for Git in your bash prompt. In other words, it gives you a summary of the state of your repository in your Bash prompt.",
                        "I was able to dramatically improve the speed by making use of goroutines."
                    ],
                    "skills": [
                        "Golang"
                    ]
                },
                {
                    "imgSrc": "",
                    "link": "https://github.com/hallzy/tv-show-notification",
                    "boldTitle": "TV Show Notification and Calendar",
                    "normalTitle": "",
                    "timePeriod": "May 2020",
                    "description": [
                        "This is a project that I started.",
                        "Created a Google App Script that retrieves air dates for episodes of TV Shows that I watch. The script uses that information to figure out what episodes I don't have in my Google Calendar already and will automatically add them for me."
                    ],
                    "skills": [
                        "Google App Script"
                    ]
                },
                {
                    "imgSrc": "",
                    "link": "https://github.com/marcobambini/gravity/pulls?page=1&q=is%3Apr+is%3Amerged+author%3Ahallzy",
                    "boldTitle": "Gravity",
                    "normalTitle": "",
                    "timePeriod": "Mar 2017 - Apr 2018",
                    "description": [
                        "Follow the link to see all 36 of my merged pull requests.",
                        "Gravity is a dynamically typed, lightweight, embeddable programming language written in C without any external dependencies (except for stdlib).",
                        "Gravity is the core language built into Creo, which was a project created to make it easier to write code for iOS and Android. Creo is no longer available.",
                        "I fixed countless compilation warnings.",
                        "I fixed and contributed to the documentation and automated tests.",
                        "I added bitwise operations, string manipulation and retrieval functions, a random number generator, and math functions to Gravity."
                    ],
                    "skills": [
                        "C",
                        "Gravity",
                        "Github"
                    ]
                },
                {
                    "imgSrc": "",
                    "link": "https://github.com/michaeldfallen/git-radar/pulls?q=is%3Apr+is%3Amerged+author%3Ahallzy+",
                    "boldTitle": "Git Radar",
                    "normalTitle": "",
                    "timePeriod": "Oct 2015 - Jan 2016",
                    "description": [
                        "Follow the link to see all of my merged pull requests.",
                        "This project gives you a \"heads up display\" for Git in your bash prompt. In other words, it gives you a summary of the state of your repository in your Bash prompt.",
                        "I added a configuration variable to customize the time between automatic \"git fetch\" commands.",
                        "Fixed a \"git stash\" error in the script.",
                        "I was active in the reported issues, offering suggestions and solutions to other users and contributors."
                    ],
                    "skills": [
                        "Bash Script",
                        "Github"
                    ]
                }
            ]
        },
        "education": {
            "title": "Education",
            "entries": [
                {
                    "imgSrc": "",
                    "boldTitle": "University of British Columbia",
                    "normalTitle": "",
                    "timePeriod": "Sept 2013 - Dec 2017",
                    "description": [
                        "Bachelor of Applied Science (BASc) in Software Engineering"
                    ],
                    "skills": [
                    ]
                },
                {
                    "imgSrc": "",
                    "boldTitle": "Kwantlen Polytechnic University",
                    "normalTitle": "",
                    "timePeriod": "Sept 2012 - April 2013",
                    "description": [
                        "Engineering Certificate"
                    ],
                    "skills": [
                    ]
                }
            ]
        },
        "interests": {
            "title": "Interests & Activities",
            "entries": [
                {
                    "imgSrc": "",
                    "boldTitle": "",
                    "normalTitle": "",
                    "timePeriod": "",
                    "description": [
                        "Learning and trying new things",
                        "Skiing, snowboarding",
                        "Baseball, hockey, lacrosse",
                        "Walking, running, hiking",
                        "Travelling"
                    ],
                    "skills": [
                    ]
                }
            ]
        }
    }
}
