{
    "pageTitle": "Steven Hall's Resume",
    "firstName": "Steven",
    "lastName": "Hall",
    "position": "Software Engineer",
    "contactInfo": [
        {
            "href": "/steven-hall-resume.pdf",
            "imgSrc": "imgs/download.png",
            "class": "print-d-none",
            "text": "Download PDF"
        },
        {
            "href": "mailto:hire.steven.hall@gmail.com",
            "imgSrc": "imgs/email.png",
            "text": "hire.steven.hall@gmail.com"
        },
        {
            "href": "https://github.com/hallzy",
            "imgSrc": "imgs/github.png",
            "text": "hallzy"
        },
        {
            "href": "https://www.linkedin.com/in/steventmhall",
            "imgSrc": "imgs/linkedin.ico",
            "text": "steventmhall"
        }
    ],
    "languages": [
        "JavaScript / jQuery",
        "Node.js",
        "CSS / SASS / Bootstrap",
        "MobX",
        "MySQL/ PostgreSQL",
        "PHP / Laravel",
        "HTML",
        "Golang",
        "C/ C++",
        "Haskell",
        "Scala",
        "Python / Selenium",
        "TypeScript",
        "VimScript",
        "Bash Script",
        "Java"
    ],
    "tools": [
        "Jira",
        "Git/ SVN",
        "Github / Bitbucket",
        "Google Ad Manager",
        "API",
        "JSON",
        "XML",
        "Linux (CLI proficient)",
        "Vim",
        "Playwright",
        "Cypress"
    ],
    "skills": [
        "Scrum / Agile",
        "Project Leadership",
        "Communication",
        "Problem Solving",
        "Mentoring"
    ],
    "projects": [
        "<a href='https://github.com/hallzy/website'>This Resume!</a>",
        "<a href='https://github.com/hallzy/go-git-radar'>Go Git Radar</a>",
        "<a href='https://github.com/hallzy/tv-show-notification'>TV Show Calendar</a>",
        "<a href='https://github.com/hallzy/youtube-playlist-search'>YouTube Playlist Search</a>"
    ],
    "openSource": [
        "<a href='https://github.com/mdn/content/issues/21002'>MDN Web Documentation Error</a>",
        "<a href='https://github.com/microsoft/playwright/issues/9268'>Browser Crash in Playwright</a>",
        "<a href='https://github.com/marcobambini/gravity/pulls?page=1&q=is%3Apr+is%3Amerged+author%3Ahallzy'>Gravity</a>",
        "<a href='https://github.com/michaeldfallen/git-radar/pulls?q=is%3Apr+is%3Amerged+author%3Ahallzy+'>Git Radar</a>"
    ],
    "sections": {
        "summary": {
            "title": "Summary",
            "entries": [
                {
                    "imgSrc": "",
                    "boldTitle": "",
                    "normalTitle": "",
                    "timePeriod": "",
                    "description": [
                        "Full-stack software engineer with over 6 years of experience designing and developing scalable, user-friendly web applications.",
                        "Proven track record in leading major frontend and backend projects.",
                        "Experienced in mentoring junior developers, optimizing code efficiency, and driving innovation in a corporate environment.",
                        "Adaptable and quick-learning professional with a strong ability to grasp new technologies and concepts efficiently.",
                        "Seeking to apply my technical expertise in a dynamic, growth-focused team to build cutting-edge software solutions."
                    ],
                    "skills": [
                    ]
                }
            ]
        },
        "work": {
            "title": "Work Experience",
            "entries": [
                {
                    "imgSrc": "imgs/stnvideo.png",
                    "boldTitle": "STN Video",
                    "normalTitle": "Full Stack Web Developer",
                    "timePeriod": "Oct 2020 - May 2024",
                    "summary": "STN Video was sold at the end of 2023, leading to a downsizing of its Canadian development team. During my tenure, I contributed to the development of STN Video's award-winning Online Video Platform. This platform featured a publisher and administrative interface along with an AI-powered video player that automatically serves contextually relevant content and ads across prominent outlets such as the New York Post, Chicago Tribune, and the Las Vegas Review-Journal. The player served 55 million monthly viewers and generated 3 billion video views on 2 million premium videos, driving millions in monthly ad revenue.",
                    "description": [
                        "Completely rewrote our award-winning Smart Match video player frontend from the ground up using the MobX reactivity framework.",
                        "The code became easier to maintain and the file was 4x smaller while improving speed and revenue.",
                        "The rewrite prevented a significant loss in revenue due to a change in Google Chrome's Heavy Ad Intervention.",
                        "Built a database driven admin tool to manage and configure settings for the player. The tool's content is generated entirely from the result of joining multiple database tables using Laravel and Eloquent so that adding a new setting to our player just requires updating tables in the database instead of needing to wait for a dashboard release, making it easier for our account managers to make use of new features quickly.",
                        "Created a new admin tool on our Dashboard to expose how the player's AI ranks video matches for a publisher's article, improving the company's ability to understand why our AI chooses certain videos over others.",
                        "Regularly participated in code reviews for our video player and dashboard products.",
                        "Released weekly A/B tests for the video player by merging approved pull requests. Coordinated with our revenue department to confirm player performance is at an expected level before fully releasing the changes.",
                        "Wrote and maintained player tests, actively participated in the QA process, and worked closely with our QA team. Improved code reliability by catching bugs early in the QA process."
                    ],
                    "skills": [
                        "Remote Work",
                        "JavaScript",
                        "jQuery",
                        "MobX",
                        "Agile",
                        "Scrum",
                        "MySQL",
                        "Git",
                        "Python",
                        "Selenium",
                        "Jira",
                        "PHP",
                        "Laravel",
                        "CSS",
                        "SASS",
                        "Bootstrap",
                        "Eloquent",
                        "Playwright",
                        "Cypress",
                        "Google Ad Manager",
                        "JSON",
                        "XML",
                        "Bash",
                        "Vim"
                    ]
                },
                {
                    "imgSrc": "imgs/linuxmagic.png",
                    "boldTitle": "LinuxMagic",
                    "normalTitle": "Full Stack Web Developer",
                    "timePeriod": "Apr 2018 - May 2020",
                    "summary": "During the COVID-19 pandemic in 2020, LinuxMagic downsized its operations. At LinuxMagic, I contributed to the development of MagicMail - a comprehensive email platform designed for small ISPs and Telcos. My work involved creating robust webmail clients for end-users, user interfaces for managing email accounts and settings, and an administrative dashboard that enabled ISPs to efficiently manage users, adjust server settings, and access support tools.",
                    "description": [
                        "Improved carrier-grade email platform (MagicMail) by enhancing features, addressing customer requests, and fixing bugs, CRM, sales system, and product websites (MagicSpam, SpamRATS)",
                        "Migrated the sales system from an Oracle database to PostgreSQL.",
                        "Led a project to redesign and rewrite the SpamRATS product website from the ground up.",
                        "Completed work orders by communicating directly with customers in a timely and professional manner.",
                        "Mentored new Web Developer hires, ensuring smooth integration and adherence to company coding standards."
                    ],
                    "skills": [
                        "JavaScript",
                        "jQuery",
                        "CSS",
                        "Bootstrap",
                        "Proprietary PHP MVC Framework",
                        "CakePHP",
                        "MySQL",
                        "PostgreSQL",
                        "SVN",
                        "Agile",
                        "Scrum",
                        "Bash",
                        "Vim"
                    ]
                },
                {
                    "imgSrc": "imgs/ubc.ico",
                    "boldTitle": "UBC",
                    "normalTitle": "Big Data Research Assistant",
                    "timePeriod": "May 2016 - Aug 2016",
                    "description": [
                        "Goal: To share memory (RDDs) across Apache Spark instances through a unified memory manager."
                    ],
                    "skills": [
                        "Scala",
                        "Python",
                        "Hadoop",
                        "Apache Spark",
                        "Git",
                        "Bash"
                    ]
                },
                {
                    "imgSrc": "imgs/ericsson.ico",
                    "boldTitle": "Ericsson",
                    "normalTitle": "Software Developer Intern",
                    "timePeriod": "Jan 2015 - Aug 2015",
                    "description": [
                        "Tested and developed QoS and PBR software solutions on a variety of Ericsson's enterprise scale routing platforms using manual router configurations and Perl scripts for testing.",
                        "Presented demos showing the functionality and progress of policy-based routing during the testing and development phases."
                    ],
                    "skills": [
                        "C",
                        "Perl",
                        "Git",
                        "CVS",
                        "Bash"
                    ]
                }
            ]
        },
        "education": {
            "title": "Education",
            "entries": [
                {
                    "imgSrc": "",
                    "boldTitle": "University of British Columbia",
                    "normalTitle": "",
                    "timePeriod": "Sep 2013 - Dec 2017",
                    "description": [
                        "Bachelor of Applied Science (BASc) in Software Engineering"
                    ],
                    "skills": [
                    ]
                },
                {
                    "imgSrc": "",
                    "boldTitle": "Kwantlen Polytechnic University",
                    "normalTitle": "",
                    "timePeriod": "Sep 2012 - Apr 2013",
                    "description": [
                        "Engineering Certificate"
                    ],
                    "skills": [
                    ]
                }
            ]
        }
    }
}
